Autodesk.Revit.DB.InCanvasControlData.ImagePath
The path to the image file to be used.
This must be an absolute path to a location on disk.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
When setting this property: The  file specified by imagePath doesn't exist.
Since:
2022

Autodesk.Revit.DB.InCanvasControlData.#ctor(System.String,Autodesk.Revit.DB.XYZ)
Constructs an InCanvasControlData with specific values assigned.
imagePath:
File path with the image to be used.
This must be an absolute path to a location on disk.
position:
The position to be used.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2022

Autodesk.Revit.DB.InCanvasControlData.#ctor(System.String)
Constructs an InCanvasControlData with specific values assigned.
imagePath:
File path with the image to be used.
This must be an absolute path to a location on disk.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2022